Repository: exodus-ai-org/ios
Catalog: Resources/App/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_br, zh_hant, zh_hk

# ios:settings.secrets.replacing
source: Replaces the saved key when you save.
de: Ersetzt den gespeicherten Schlüssel beim Speichern.
es: Sustituirá la clave guardada al guardar.
fr: Remplacera la clé enregistrée lors de l’enregistrement.
it: Sostituirà la chiave salvata al salvataggio.
ja: 保存すると、保存済みのキーが置き換えられます。
ko: 저장하면 저장된 키가 대체됩니다.
pt_br: Substituirá a chave salva quando você salvar.
zh_hant: 儲存時會取代已儲存的金鑰。
zh_hk: 儲存時會取代已儲存的金鑰。

# ios:settings.secrets.willClear
source: The saved key is removed when you save.
de: Der gespeicherte Schlüssel wird beim Speichern entfernt.
es: La clave guardada se eliminará al guardar.
fr: La clé enregistrée sera supprimée lors de l’enregistrement.
it: La chiave salvata verrà rimossa al salvataggio.
ja: 保存すると、保存済みのキーは削除されます。
ko: 저장하면 저장된 키가 삭제됩니다.
pt_br: A chave salva será removida quando você salvar.
zh_hant: 儲存時會移除已儲存的金鑰。
zh_hk: 儲存時會移除已儲存的金鑰。

# ios:settings.skills.desktopOnly
source: Find, install and remove skills in Exodus on your computer, or with exodus-cli.
de: Skills suchen, installieren und entfernen Sie in Exodus auf Ihrem Computer oder mit exodus-cli.
es: Busca, instala y elimina skills en Exodus en tu ordenador o con exodus-cli.
fr: Recherchez, installez et supprimez des skills dans Exodus sur votre ordinateur, ou avec exodus-cli.
it: Cerca, installa e rimuovi le skill in Exodus sul tuo computer o con exodus-cli.
ja: スキルの検索・インストール・削除は、コンピュータの Exodus か exodus-cli で行います。
ko: 스킬 찾기, 설치, 제거는 컴퓨터의 Exodus 또는 exodus-cli에서 할 수 있습니다.
pt_br: Encontre, instale e remova skills no Exodus do seu computador ou com o exodus-cli.
zh_hant: 請在電腦上的 Exodus 或使用 exodus-cli 尋找、安裝和移除技能。
zh_hk: 請在電腦上的 Exodus 或使用 exodus-cli 尋找、安裝和移除技能。

# ios:settings.skills.loadFailed
source: Couldn’t load skills
de: Skills konnten nicht geladen werden
es: No se pudieron cargar las skills
fr: Impossible de charger les skills
it: Impossibile caricare le skill
ja: スキルを読み込めませんでした
ko: 스킬을 불러올 수 없습니다
pt_br: Não foi possível carregar as skills
zh_hant: 無法載入技能
zh_hk: 無法載入技能

# ios:settings.toolbar.connect
source: Connect
de: Verbinden
es: Conectar
fr: Se connecter
it: Connetti
ja: 接続
ko: 연결
pt_br: Conectar
zh_hant: 連線
zh_hk: 連線

# ios:settings.tools.configureOnComputer
source: Keys and options for the tools that need them are set up in Built-in Tools on your computer.
de: Schlüssel und Optionen für die Tools, die sie brauchen, richten Sie unter „Integrierte Tools“ auf Ihrem Computer ein.
es: Las claves y opciones de las herramientas que las necesitan se configuran en Herramientas integradas, en tu ordenador.
fr: Les clés et options des outils qui en ont besoin se règlent dans Outils intégrés, sur votre ordinateur.
it: Chiavi e opzioni degli strumenti che le richiedono si impostano in Strumenti integrati, sul tuo computer.
ja: キーやオプションが必要なツールは、コンピュータの「組み込みツール」で設定します。
ko: 키나 옵션이 필요한 도구는 컴퓨터의 내장 도구에서 설정합니다.
pt_br: Chaves e opções das ferramentas que precisam delas são configuradas em Ferramentas Integradas, no seu computador.
zh_hant: 需要金鑰或有選項的工具，請在電腦上的「內建工具」中設定。
zh_hk: 需要金鑰或有選項的工具，請在電腦上的「內建工具」中設定。

# ios:settings.tools.intro
source: What the model may call on its own. Turn a tool off to keep it out of every chat, on this phone and on the computer.
de: Was das Modell von sich aus aufrufen darf. Schalten Sie ein Tool aus, um es aus allen Chats herauszuhalten, auf diesem Telefon und auf dem Computer.
es: Lo que el modelo puede usar por su cuenta. Desactiva una herramienta para que no se use en ningún chat, ni en este teléfono ni en el ordenador.
fr: Ce que le modèle peut appeler de lui-même. Désactivez un outil pour l'exclure de toutes les conversations, sur ce téléphone comme sur l'ordinateur.
it: Ciò che il modello può usare di sua iniziativa. Disattiva uno strumento per escluderlo da tutte le chat, su questo telefono e sul computer.
ja: モデルが自分の判断で呼び出せるツールです。オフにしたツールは、このスマートフォンでもコンピュータでも、どのチャットでも使われません。
ko: 모델이 스스로 호출할 수 있는 도구입니다. 도구를 끄면 이 휴대폰과 컴퓨터의 모든 채팅에서 사용되지 않습니다.
pt_br: O que o modelo pode usar por conta própria. Desative uma ferramenta para mantê-la fora de todos os chats, neste celular e no computador.
zh_hant: 模型可以自行呼叫的工具。關閉某個工具後，所有聊天都不會使用它，無論是在這支手機還是電腦上。
zh_hk: 模型可以自行調用的工具。關閉某個工具後，所有聊天都不會使用它，無論是在這部手機還是電腦上。

# ios:settings.tools.unknownFooter
source: Your computer has switched off tools this version of the app doesn't know. They stay off; update the app to switch them here.
de: Ihr Computer hat Tools ausgeschaltet, die diese App-Version nicht kennt. Sie bleiben aus; aktualisieren Sie die App, um sie hier zu schalten.
es: Tu ordenador ha desactivado herramientas que esta versión de la app no conoce. Siguen desactivadas; actualiza la app para gestionarlas aquí.
fr: Votre ordinateur a désactivé des outils que cette version de l'app ne connaît pas. Ils restent désactivés ; mettez l'app à jour pour les gérer ici.
it: Il tuo computer ha disattivato strumenti che questa versione dell'app non conosce. Restano disattivati; aggiorna l'app per gestirli qui.
ja: このバージョンのアプリが認識できないツールがコンピュータでオフになっています。オフのまま維持されます。ここで切り替えるにはアプリをアップデートしてください。
ko: 컴퓨터에서 이 버전의 앱이 모르는 도구가 꺼져 있습니다. 꺼진 상태로 유지되며, 여기서 전환하려면 앱을 업데이트하세요.
pt_br: Seu computador desativou ferramentas que esta versão do app não conhece. Elas continuam desativadas; atualize o app para alterná-las aqui.
zh_hant: 你的電腦關閉了這個版本的 App 還不認得的工具。它們會維持關閉；更新 App 後即可在這裡切換。
zh_hk: 你的電腦關閉了這個版本的 App 還未認得的工具。它們會保持關閉；更新 App 後便可在這裡切換。

# ios:settings.tools.unknownTitle
source: Also off on your computer
de: Auch auf Ihrem Computer aus
es: También desactivadas en tu ordenador
fr: Également désactivés sur votre ordinateur
it: Disattivati anche sul tuo computer
ja: コンピュータでもオフ
ko: 컴퓨터에서도 꺼짐
pt_br: Também desativadas no seu computador
zh_hant: 電腦上也已關閉
zh_hk: 電腦上亦已關閉

# settings:dataControls.autoBackup.description
source: Back up your data daily at 3:00 AM. Backups are stored locally in ~/.exodus/backups/.
de: Sichert Ihre Daten täglich um 3:00 Uhr. Backups werden lokal unter ~/.exodus/backups/ gespeichert.
es: Haga una copia de seguridad de sus datos todos los días a las 3:00 a. m. Las copias se guardan localmente en ~/.exodus/backups/.
fr: Sauvegardez vos données quotidiennement à 3h00. Les sauvegardes sont stockées localement dans ~/.exodus/backups/.
it: Esegue il backup dei tuoi dati ogni giorno alle 3:00. I backup vengono salvati localmente in ~/.exodus/backups/.
ja: 毎日午前3:00にデータをバックアップします。バックアップは~/.exodus/backups/にローカル保存されます。
ko: 매일 오전 3시에 데이터를 백업합니다. 백업은 ~/.exodus/backups/에 로컬로 저장됩니다.
pt_br: Faça backup dos seus dados diariamente às 3h. Os backups são armazenados localmente em ~/.exodus/backups/.
zh_hant: 每天凌晨 3:00 備份你的資料。備份會儲存於本機的 ~/.exodus/backups/。
zh_hk: 每天凌晨 3:00 備份你的資料，備份會儲存在本機的 ~/.exodus/backups/。

# settings:dataControls.autoBackup.label
source: Automatic Backups
de: Automatische Backups
es: Copias de seguridad automáticas
fr: Sauvegardes automatiques
it: Backup automatici
ja: 自動バックアップ
ko: 자동 백업
pt_br: Backups Automáticos
zh_hant: 自動備份
zh_hk: 自動備份

# settings:dataControls.backupNow.button
source: Back Up Now
de: Jetzt sichern
es: Hacer copia de seguridad ahora
fr: Sauvegarder maintenant
it: Esegui backup ora
ja: 今すぐバックアップ
ko: 지금 백업
pt_br: Fazer Backup Agora
zh_hant: 立即備份
zh_hk: 立即備份

# settings:dataControls.backupNow.errorToast
source: Backup failed
de: Backup fehlgeschlagen
es: Error al crear la copia de seguridad
fr: Échec de la sauvegarde
it: Backup non riuscito
ja: バックアップに失敗しました
ko: 백업 실패
pt_br: Falha no backup
zh_hant: 備份失敗
zh_hk: 備份失敗

# settings:dataControls.backupNow.successToast
source: Backup created
de: Backup erstellt
es: Copia de seguridad creada
fr: Sauvegarde créée
it: Backup creato
ja: バックアップを作成しました
ko: 백업이 생성되었습니다
pt_br: Backup criado
zh_hant: 已建立備份
zh_hk: 已建立備份

# settings:dataControls.lastBackup.label
source: Last Backup
de: Letztes Backup
es: Última copia de seguridad
fr: Dernière sauvegarde
it: Ultimo backup
ja: 最終バックアップ
ko: 마지막 백업
pt_br: Último Backup
zh_hant: 上次備份
zh_hk: 上次備份

# settings:dataControls.lastBackup.none
source: No backups yet
de: Noch keine Backups
es: Aún no hay copias de seguridad
fr: Aucune sauvegarde pour le moment
it: Nessun backup ancora
ja: まだバックアップがありません
ko: 아직 백업이 없습니다
pt_br: Ainda não há backups
zh_hant: 尚無備份
zh_hk: 尚無備份

# settings:dataControls.recentBackups.label
source: Recent Backups
de: Letzte Backups
es: Copias de seguridad recientes
fr: Sauvegardes récentes
it: Backup recenti
ja: 最近のバックアップ
ko: 최근 백업
pt_br: Backups Recentes
zh_hant: 最近的備份
zh_hk: 最近的備份

# settings:general.colorTone.description
source: Choose a color accent for the interface
de: Wähle eine Akzentfarbe für die Oberfläche
es: Elige un color de acento para la interfaz
fr: Choisissez une couleur d'accent pour l'interface
it: Scegli un colore di accento per l'interfaccia
ja: インターフェースのアクセントカラーを選択します
ko: 인터페이스의 강조 색상을 선택합니다
pt_br: Escolha uma cor de destaque para a interface
zh_hant: 為介面選擇一種強調色
zh_hk: 為介面選擇一種強調色

# settings:general.colorTone.label
source: Color tone
de: Farbton
es: Tono de color
fr: Teinte
it: Tonalità
ja: カラートーン
ko: 색조
pt_br: Tom de cor
zh_hant: 色調
zh_hk: 色調

# settings:general.colorTone.tones.blue
source: Blue
de: Blau
es: Azul
fr: Bleu
it: Blu
ja: ブルー
ko: 블루
pt_br: Azul
zh_hant: 藍色
zh_hk: 藍色

# settings:general.colorTone.tones.emerald
source: Emerald
de: Smaragd
es: Esmeralda
fr: Émeraude
it: Smeraldo
ja: エメラルド
ko: 에메랄드
pt_br: Esmeralda
zh_hant: 翡翠綠
zh_hk: 翡翠綠

# settings:general.colorTone.tones.rose
source: Rose
de: Rosé
es: Rosa
it: Rosa
ja: ローズ
ko: 로즈
pt_br: Rosa
zh_hant: 玫瑰紅
zh_hk: 玫瑰紅

# settings:general.colorTone.tones.violet
source: Violet
de: Violett
es: Violeta
it: Viola
ja: バイオレット
ko: 바이올렛
pt_br: Violeta
zh_hant: 紫羅蘭
zh_hk: 紫羅蘭

# settings:general.colorTone.tones.yellow
source: Yellow
de: Gelb
es: Amarillo
fr: Jaune
it: Giallo
ja: イエロー
ko: 옐로
pt_br: Amarelo
zh_hant: 黃色
zh_hk: 黃色

# settings:mcpServers.empty
source: No MCP servers configured yet.
de: Noch keine MCP-Server konfiguriert.
es: Aún no hay servidores MCP configurados.
fr: Aucun serveur MCP configuré pour le moment.
it: Nessun server MCP configurato ancora.
ja: MCPサーバーはまだ設定されていません。
ko: 아직 구성된 MCP 서버가 없습니다.
pt_br: Ainda não há servidores MCP configurados.
zh_hant: 尚未設定任何 MCP 伺服器。
zh_hk: 尚未設定任何 MCP 伺服器。

# settings:mcpServers.emptyHint
source: Servers you register show up here, each with a switch for its tools.
de: Registrierte Server erscheinen hier, jeweils mit einem Schalter für ihre Tools.
es: Los servidores que registres aparecerán aquí, cada uno con un interruptor para sus herramientas.
fr: Les serveurs que vous enregistrez apparaissent ici, chacun avec un interrupteur pour ses outils.
it: I server che registri compaiono qui, ciascuno con un interruttore per i suoi strumenti.
ja: 登録したサーバーがここに表示され、それぞれのツールをスイッチで切り替えられます。
ko: 등록한 서버가 여기에 표시되며, 서버마다 도구를 켜고 끄는 스위치가 있습니다.
pt_br: Os servidores que você registrar aparecem aqui, cada um com uma chave para suas ferramentas.
zh_hant: 你註冊的伺服器會顯示在這裡，每個都有開關控制其工具。
zh_hk: 你註冊的伺服器會顯示在這裡，每個都有開關控制其工具。

# settings:mcpServers.serverCard.hideTools
source: Hide tools
de: Tools ausblenden
es: Ocultar herramientas
fr: Masquer les outils
it: Nascondi strumenti
ja: ツールを非表示
ko: 도구 숨기기
pt_br: Ocultar ferramentas
zh_hant: 隱藏工具
zh_hk: 隱藏工具

# settings:mcpServers.serverCard.showTools
source: Show tools
de: Tools anzeigen
es: Mostrar herramientas
fr: Afficher les outils
it: Mostra strumenti
ja: ツールを表示
ko: 도구 표시
pt_br: Mostrar ferramentas
zh_hant: 顯示工具
zh_hk: 顯示工具

# settings:mcpServers.toast.toggleFailed
source: Failed to toggle server
de: Server konnte nicht umgeschaltet werden
es: No se pudo alternar el servidor
fr: Échec du basculement du serveur
it: Impossibile attivare/disattivare il server
ja: サーバーの切り替えに失敗しました
ko: 서버 전환에 실패했습니다
pt_br: Falha ao alternar servidor
zh_hant: 切換伺服器狀態失敗
zh_hk: 切換伺服器狀態失敗

# settings:memory.detail.detailsPlaceholder
source: One fact per line
de: Eine Tatsache pro Zeile
es: Un dato por línea
fr: Un fait par ligne
it: Un fatto per riga
ja: 1行に1つの事実
ko: 한 줄에 하나씩 사실을 입력하세요
pt_br: Um fato por linha
zh_hant: 每行一項事實
zh_hk: 每行一項事實

# settings:memory.detail.summaryLabel
source: Summary
de: Zusammenfassung
es: Resumen
fr: Résumé
it: Riepilogo
ja: 要約
ko: 요약
pt_br: Resumo
zh_hant: 摘要
zh_hk: 摘要

# settings:memory.detail.summaryPlaceholder
source: A compact phrase — what this entry covers
de: Ein kurzer Satz — worum es in diesem Eintrag geht
es: Una frase breve: qué cubre esta entrada
fr: Une phrase concise — ce que couvre cette entrée
it: Una frase compatta — cosa copre questa voce
ja: 簡潔なフレーズ — このエントリが扱う内容
ko: 간단한 문구로 — 이 항목이 다루는 내용
pt_br: Uma frase concisa — o que esta entrada abrange
zh_hant: 簡短描述——這筆項目涵蓋的內容
zh_hk: 簡短描述——此項目涵蓋的內容

# settings:memory.detail.titlePlaceholder
source: Title
de: Titel
es: Título
fr: Titre
it: Titolo
ja: タイトル
ko: 제목
pt_br: Título
zh_hant: 標題
zh_hk: 標題

# settings:memory.detail.toast.deleteFailedTitle
source: Failed to delete
de: Löschen fehlgeschlagen
es: No se pudo eliminar
fr: Échec de la suppression
it: Eliminazione non riuscita
ja: 削除に失敗しました
ko: 삭제에 실패했습니다
pt_br: Falha ao excluir
zh_hant: 刪除失敗
zh_hk: 刪除失敗

# settings:memory.detail.toast.notSavedTitle
source: Not saved
de: Nicht gespeichert
es: No se guardó
fr: Non enregistré
it: Non salvato
ja: 保存されませんでした
ko: 저장되지 않음
pt_br: Não salvo
zh_hant: 尚未儲存
zh_hk: 尚未儲存

# settings:memory.disableLabel
source: Disable
de: Deaktivieren
es: Desactivar
fr: Désactiver
it: Disattiva
ja: 無効化
ko: 비활성화
pt_br: Desativar
zh_hant: 停用
zh_hk: 停用

# settings:memory.restoreLabel
source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
it: Ripristina
ja: 復元
ko: 복원
pt_br: Restaurar
zh_hant: 還原
zh_hk: 還原

# settings:memory.row.noSummaryYet
source: No summary yet
de: Noch keine Zusammenfassung
es: Aún no hay resumen
fr: Aucun résumé pour le moment
it: Nessun riepilogo ancora
ja: まだ要約がありません
ko: 아직 요약이 없습니다
pt_br: Ainda não há resumo
zh_hant: 尚無摘要
zh_hk: 尚無摘要

# settings:memory.sectionGroups.person
source: People
de: Personen
es: Personas
fr: Personnes
it: Persone
ja: 人物
ko: 사람
pt_br: Pessoas
zh_hant: 人物
zh_hk: 人物

# settings:memory.sectionGroups.profile
source: You
de: Sie
es: Tú
fr: Vous
it: Tu
ja: あなた
ko: 나
pt_br: Você
zh_hant: 你
zh_hk: 你

# settings:memory.sectionGroups.topic
source: Topics
de: Themen
es: Temas
fr: Sujets
it: Argomenti
ja: トピック
ko: 주제
pt_br: Tópicos
zh_hant: 主題
zh_hk: 主題

# settings:memory.settings.autoCapture.description
source: After each conversation, consolidate durable facts about you (interests, setup, people) into memory — updating existing entries rather than duplicating them.
de: Fasst nach jeder Unterhaltung dauerhafte Fakten über Sie (Interessen, Einrichtung, Personen) im Gedächtnis zusammen — bestehende Einträge werden aktualisiert, statt sie zu duplizieren.
es: Después de cada conversación, consolide los datos duraderos sobre usted (intereses, configuración, personas) en la memoria, actualizando las entradas existentes en lugar de duplicarlas.
fr: Après chaque conversation, consolide en mémoire les faits durables vous concernant (centres d'intérêt, configuration, personnes) — en mettant à jour les entrées existantes plutôt qu'en les dupliquant.
it: Dopo ogni conversazione, consolida in memoria i fatti duraturi su di te (interessi, configurazione, persone) — aggiornando le voci esistenti anziché duplicarle.
ja: 各会話の後、あなたに関する永続的な事実(興味、環境、人物など)を重複させることなく既存のエントリを更新しながらメモリーに統合します。
ko: 대화가 끝날 때마다 당신에 대한 지속적인 사실(관심사, 설정, 사람)을 메모리로 통합합니다 — 중복 생성 대신 기존 항목을 업데이트합니다.
pt_br: Após cada conversa, consolidar fatos duradouros sobre você (interesses, configuração, pessoas) na memória — atualizando entradas existentes em vez de duplicá-las.
zh_hant: 每次對話結束後，將關於你的持久性事實（興趣、環境設定、相關人物）整合進記憶中——更新既有項目，而非重複建立。
zh_hk: 每次對話結束後，將關於你的持久事實（興趣、設定、相關人物）整合進記憶——更新現有項目，而非重複建立。

# settings:memory.settings.autoCapture.label
source: Capture memories
de: Gedächtnis erfassen
es: Capturar memorias
fr: Capturer les mémoires
it: Cattura memorie
ja: メモリーを記録
ko: 메모리 자동 기록
pt_br: Capturar memórias
zh_hant: 擷取記憶
zh_hk: 擷取記憶

# settings:memory.settings.contextWindowPercent.description
source: Trigger context compaction when the conversation reaches this percentage of the model's context window (50-95%). Default: 75%.
de: Löst die Kontextkomprimierung aus, sobald die Unterhaltung diesen Prozentsatz des Kontextfensters des Modells erreicht (50-95 %). Standard: 75 %.
es: Active la compactación de contexto cuando la conversación alcance este porcentaje de la ventana de contexto del modelo (50-95 %). Predeterminado: 75 %.
fr: Déclenche le compactage du contexte lorsque la conversation atteint ce pourcentage de la fenêtre de contexte du modèle (50 à 95 %). Par défaut : 75 %.
it: Attiva la compattazione del contesto quando la conversazione raggiunge questa percentuale della finestra di contesto del modello (50-95%). Predefinito: 75%.
ja: 会話がモデルのコンテキストウィンドウのこの割合(50〜95%)に達すると、コンテキストの圧縮を実行します。デフォルト: 75%。
ko: 대화가 모델 컨텍스트 윈도우의 이 비율(50~95%)에 도달하면 컨텍스트 압축을 실행합니다. 기본값: 75%.
pt_br: Acionar a compactação de contexto quando a conversa atingir esta porcentagem da janela de contexto do modelo (50-95%). Padrão: 75%.
zh_hant: 當對話達到模型內容視窗的此百分比（50-95%）時，觸發內容壓縮。預設值：75%。
zh_hk: 當對話達到模型內容視窗的此百分比（50-95%）時，觸發內容壓縮。預設值：75%。

# settings:memory.settings.contextWindowPercent.label
source: Compaction threshold
de: Komprimierungsschwelle
es: Umbral de compactación
fr: Seuil de compactage
it: Soglia di compattazione
ja: 圧縮のしきい値
ko: 압축 임계값
pt_br: Limite de compactação
zh_hant: 壓縮閾值
zh_hk: 壓縮閾值

# settings:memory.settings.disabledHeading
source: Disabled · %@
de: Deaktiviert · %@
es: Desactivadas · %@
fr: Désactivées · %@
it: Disattivate · %@
ja: 無効 · %@
ko: 비활성화됨 · %@
pt_br: Desativadas · %@
zh_hant: 已停用 · %@
zh_hk: 已停用 · %@

# settings:memory.settings.emptyTitle
source: No memories yet
de: Noch keine Gedächtniseinträge
es: Aún no hay memorias
fr: Aucune mémoire pour le moment
it: Ancora nessuna memoria
ja: メモリーはまだありません
ko: 아직 메모리가 없습니다
pt_br: Ainda não há memórias
zh_hant: 尚無任何記憶
zh_hk: 尚無任何記憶

# settings:memory.settings.freshTailSize.description
source: Number of recent runs — a message of yours with every model step and tool result that answered it — protected from compaction (2-24). They are always sent to the model verbatim. Default: 6.
de: Anzahl der neuesten Durchläufe – eine Nachricht von dir mit jedem Modellschritt und Werkzeugergebnis, das sie beantwortet hat –, die von der Komprimierung ausgenommen sind (2–24). Sie werden dem Modell immer unverändert gesendet. Standard: 6.
es: Número de ejecuciones recientes (un mensaje tuyo con cada paso del modelo y resultado de herramienta que lo respondió) protegidas de la compactación (2-24). Siempre se envían al modelo tal cual. Predeterminado: 6.
fr: Nombre d'exécutions récentes — un de vos messages avec chaque étape du modèle et résultat d'outil qui y a répondu — protégées du compactage (2 à 24). Elles sont toujours envoyées au modèle telles quelles. Par défaut : 6.
it: Numero di esecuzioni recenti — un tuo messaggio con ogni passaggio del modello e risultato di strumento che gli ha risposto — protette dalla compattazione (2-24). Vengono sempre inviate al modello così come sono. Predefinito: 6.
ja: 圧縮から保護される直近のラン数（2〜24）。ランとは、あなたのメッセージ 1 件と、それに応答したモデルの各ステップおよびツール結果のことです。これらは常にそのままモデルに送信されます。デフォルト: 6。
ko: 압축에서 제외되는 최근 실행 수(2~24)입니다. 실행이란 사용자의 메시지 하나와 그에 응답한 모든 모델 단계 및 도구 결과를 말합니다. 이 실행은 항상 모델에 그대로 전송됩니다. 기본값: 6.
pt_br: Número de execuções recentes — uma mensagem sua com cada etapa do modelo e resultado de ferramenta que a respondeu — protegidas contra compactação (2-24). Elas são sempre enviadas ao modelo sem alterações. Padrão: 6.
zh_hant: 不受壓縮影響的最近回合數量（2-24）。一個回合是你的一則訊息，連同回應它的每一個模型步驟和工具結果。這些回合永遠會原樣傳送給模型。預設值：6。
zh_hk: 不受壓縮影響的最近回合數量（2-24）。一個回合是你的一則訊息，連同回應它的每一個模型步驟和工具結果。這些回合會一律以原文傳送給模型。預設值：6。

# settings:memory.settings.freshTailSize.label
source: Fresh tail size
de: Anzahl aktueller Nachrichten
es: Tamaño de la cola reciente
fr: Taille de la fenêtre récente
it: Dimensione della coda recente
ja: 直近メッセージの保護数
ko: 최신 유지 메시지 수
pt_br: Tamanho da cauda recente
zh_hant: 保留訊息數
zh_hk: 保留訊息數量

# settings:memory.settings.lcmEnabled.description
source: Automatically compress long conversations into a hierarchical summary DAG, so nothing is ever lost even when chats exceed the context window.
de: Komprimiert lange Unterhaltungen automatisch zu einem hierarchischen Zusammenfassungs-DAG, sodass nichts verloren geht, selbst wenn Chats das Kontextfenster überschreiten.
es: Comprima automáticamente las conversaciones largas en un resumen jerárquico en forma de DAG, de modo que nunca se pierda nada, incluso cuando los chats superen la ventana de contexto.
fr: Compresse automatiquement les longues conversations en un DAG hiérarchique de résumés, afin que rien ne soit jamais perdu même lorsque les conversations dépassent la fenêtre de contexte.
it: Comprime automaticamente le conversazioni lunghe in un riepilogo gerarchico (DAG), così nulla va mai perso anche quando le chat superano la finestra di contesto.
ja: 長い会話を階層的な要約DAGに自動圧縮し、チャットがコンテキストウィンドウを超えても情報が失われないようにします。
ko: 긴 대화를 계층적 요약 DAG로 자동 압축하여, 채팅이 컨텍스트 윈도우를 초과해도 아무 정보도 손실되지 않도록 합니다.
pt_br: Comprime automaticamente conversas longas em um resumo hierárquico em DAG, para que nada se perca mesmo quando os chats excedem a janela de contexto.
zh_hant: 自動將長對話壓縮成階層式摘要 DAG，即使聊天超出模型的內容視窗，也不會遺失任何資訊。
zh_hk: 自動將長對話壓縮成階層式摘要 DAG，即使聊天超出模型的內容視窗，亦不會遺失任何資訊。

# settings:memory.settings.lcmEnabled.label
source: Lossless context management
de: Verlustfreies Kontextmanagement
es: Gestión de contexto sin pérdidas
fr: Gestion du contexte sans perte
it: Gestione del contesto senza perdite
ja: ロスレスなコンテキスト管理
ko: 무손실 컨텍스트 관리
pt_br: Gerenciamento de contexto sem perdas
zh_hant: 無損內容管理
zh_hk: 無損內容管理

# settings:memory.settings.loadFailedTitle
source: Couldn’t load your memories
de: Gedächtniseinträge konnten nicht geladen werden
es: No se pudieron cargar las memorias
fr: Échec du chargement des mémoires
it: Caricamento delle memorie non riuscito
ja: メモリーの読み込みに失敗しました
ko: 메모리를 불러오지 못했습니다
pt_br: Falha ao carregar memórias
zh_hant: 載入記憶失敗
zh_hk: 載入記憶失敗

# settings:memory.settings.sections.context
source: Context management
de: Kontextverwaltung
es: Gestión del contexto
fr: Gestion du contexte
it: Gestione del contesto
ja: コンテキスト管理
ko: 컨텍스트 관리
pt_br: Gerenciamento de contexto
zh_hant: 上下文管理
zh_hk: 上下文管理

# settings:memory.settings.sections.memory
source: Memory
de: Gedächtnis
es: Memoria
fr: Mémoire
it: Memoria
ja: メモリー
ko: 메모리
pt_br: Memória
zh_hant: 記憶
zh_hk: 記憶

# settings:memory.settings.storedMemoriesHeading
source: Stored memories
de: Gespeicherte Gedächtniseinträge
es: Memorias almacenadas
fr: Mémoires enregistrées
it: Memorie salvate
ja: 保存されたメモリー
ko: 저장된 메모리
pt_br: Memórias armazenadas
zh_hant: 已儲存的記憶
zh_hk: 已儲存的記憶

# settings:memory.settings.toast.createFailedTitle
source: Failed to create
de: Erstellen fehlgeschlagen
es: No se pudo crear
fr: Échec de la création
it: Creazione non riuscita
ja: 作成に失敗しました
ko: 생성에 실패했습니다
pt_br: Falha ao criar
zh_hant: 建立失敗
zh_hk: 建立失敗

# settings:memory.settings.useInChat.description
source: Surface the memory entries relevant to your message into the assistant's context at the start of a reply.
de: Blendet die für Ihre Nachricht relevanten Gedächtniseinträge zu Beginn einer Antwort in den Kontext des Assistenten ein.
es: Mostrar las entradas de memoria relevantes para su mensaje en el contexto del asistente al comenzar una respuesta.
fr: Fait remonter les entrées de mémoire pertinentes pour votre message dans le contexte de l'assistant au début d'une réponse.
it: Porta in evidenza nel contesto dell'assistente le voci di memoria pertinenti al tuo messaggio, all'inizio di una risposta.
ja: メッセージに関連するメモリーのエントリを、応答の開始時にアシスタントのコンテキストに反映します。
ko: 응답을 시작할 때 메시지와 관련된 메모리 항목을 어시스턴트의 컨텍스트에 반영합니다.
pt_br: Trazer as entradas de memória relevantes para sua mensagem ao contexto do assistente no início de uma resposta.
zh_hant: 在回覆開始時，將與你的訊息相關的記憶項目帶入助理的內容脈絡中。
zh_hk: 在回覆開始時，將與你的訊息相關的記憶項目帶入助理的內容脈絡中。
